notes/live-coding/11-06-Introduction-to-Clojure.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-06 Fri 13:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction to Clojure</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mark Armstrong" />
<meta name="description" content="An introduction to Clojure, a language in which
programs themselves are written as data within the language."
 />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Introduction to Clojure</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#Introduction">1. Introduction</a></li>
<li><a href="#Motivation">2. Motivation</a></li>
<li><a href="#The-syntax-and-(most-of)-the-semantics-of-Clojure">3. The syntax and (most of) the semantics of Clojure</a></li>
<li><a href="#Special-forms;-the-~def~-and-~defn~-forms">4. Special forms; the <code>def</code> and <code>defn</code> forms</a></li>
<li><a href="#The-~quote~,-~'~">5. The <code>quote</code>, <code>'</code></a></li>
<li><a href="#Conditional-forms">6. Conditional forms</a></li>
<li><a href="#~do~,-for-sequential-computation">7. <code>do</code>, for sequential computation</a></li>
</ul>
</div>
</div>

<div id="outline-container-Introduction" class="outline-2">
<h2 id="Introduction"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-Introduction">
<p>
These notes were created for, and in some parts <b>during</b>,
the lecture on November 6th and the following tutorials.
</p>
</div>
</div>

<div id="outline-container-Motivation" class="outline-2">
<h2 id="Motivation"><span class="section-number-2">2</span> Motivation</h2>
<div class="outline-text-2" id="text-Motivation">
<p>
:TODO:
</p>
</div>
</div>

<div id="outline-container-The-syntax-and-(most-of)-the-semantics-of-Clojure" class="outline-2">
<h2 id="The-syntax-and-(most-of)-the-semantics-of-Clojure"><span class="section-number-2">3</span> The syntax and (most of) the semantics of Clojure</h2>
<div class="outline-text-2" id="text-The-syntax-and-(most-of)-the-semantics-of-Clojure">
<p>
The syntax of Lisps such as Clojure tend to be extremely minimal.
For today at least, we will work with a subset of the language
described by the following grammar, which is sufficient
for a fair amount of programming.
</p>
<div class="org-src-container">
<pre class="src src-text"><span style="color: #00cd68;">&#10216;</span>expr<span style="color: #00cd68;">&#10217;</span> ::= number
         | "nil"
         | <span style="color: #00cd68;">&#10216;</span>list<span style="color: #00cd68;">&#10217;</span>
         | <span style="color: #00cd68;">&#10216;</span>array<span style="color: #00cd68;">&#10217;</span>
         | symbol

<span style="color: #00cd68;">&#10216;</span>list<span style="color: #00cd68;">&#10217;</span> &#8759;= "<span style="color: #00cd68;">(</span>" <span style="color: #b6a0ff;">{</span><span style="color: #6ae4b9;">&#10216;</span>expr<span style="color: #6ae4b9;">&#10217;</span><span style="color: #b6a0ff;">}</span> "<span style="color: #00cd68;">)</span>"

<span style="color: #00cd68;">&#10216;</span>array<span style="color: #00cd68;">&#10217;</span> &#8759;= "<span style="color: #00cd68;">[</span>" <span style="color: #b6a0ff;">{</span><span style="color: #6ae4b9;">&#10216;</span>expr<span style="color: #6ae4b9;">&#10217;</span><span style="color: #b6a0ff;">}</span> "<span style="color: #00cd68;">]</span>"
</pre>
</div>

<p>
For example, the following are all Clojure expressions.
</p>
<div class="org-src-container">
<pre class="src src-clojure">2
-1

<span style="color: #00cd68;">()</span>
'<span style="color: #00cd68;">(</span>1 2 3<span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">[</span>1 2 3<span style="color: #00cd68;">]</span>
<span style="color: #00cd68;">[]</span>

</pre>
</div>

<p>
Clojure programs are written as lists,
with the head of the list being the <i>operator</i> and
the tail of the list being the <i>operands</i>.
The (regular) semantics of Clojure expressions
can be described in just two lines;
to evaluate a list,
</p>
<ol class="org-ol">
<li>evaluate each element of the list, and then</li>
<li>apply the operands to the operator.</li>
</ol>

<p>
For instance,
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #00cd68;">(</span>+ 1 2<span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-Special-forms;-the-~def~-and-~defn~-forms" class="outline-2">
<h2 id="Special-forms;-the-~def~-and-~defn~-forms"><span class="section-number-2">4</span> Special forms; the <code>def</code> and <code>defn</code> forms</h2>
<div class="outline-text-2" id="text-Special-forms;-the-~def~-and-~defn~-forms">
<p>
When or if the evaluation rules of Clojure given above
prove too limiting, Clojure allows for “special forms”
(pieces of syntax handled differently by the compiler)
to implement constructs.
</p>

<p>
The first of these we will consider 
</p>

<p>
For instance, here is code which defines two methods,
called <code>square</code> and <code>sum_of_squares</code>,
and then calls <code>sum_of_squares</code> with arguments <code>2</code> and <code>3</code>.
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">defn</span> <span style="color: #feacd0;">square</span> <span style="color: #b6a0ff;">[</span>x<span style="color: #b6a0ff;">]</span> <span style="color: #b6a0ff;">(</span>* x x<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">defn</span> <span style="color: #feacd0;">sum-of-squares</span> <span style="color: #b6a0ff;">[</span>x y<span style="color: #b6a0ff;">]</span>
  <span style="color: #b6a0ff;">(</span>+ <span style="color: #6ae4b9;">(</span>square x<span style="color: #6ae4b9;">)</span>
     <span style="color: #6ae4b9;">(</span>square y<span style="color: #6ae4b9;">)</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>

<span style="color: #00cd68;">(</span>sum-of-squares 2 3<span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-The-~quote~,-~'~" class="outline-2">
<h2 id="The-~quote~,-~'~"><span class="section-number-2">5</span> The <code>quote</code>, <code>'</code></h2>
<div class="outline-text-2" id="text-The-~quote~,-~'~">
</div>
</div>

<div id="outline-container-Conditional-forms" class="outline-2">
<h2 id="Conditional-forms"><span class="section-number-2">6</span> Conditional forms</h2>
<div class="outline-text-2" id="text-Conditional-forms">
</div>
</div>

<div id="outline-container-~do~,-for-sequential-computation" class="outline-2">
<h2 id="~do~,-for-sequential-computation"><span class="section-number-2">7</span> <code>do</code>, for sequential computation</h2>
<div class="outline-text-2" id="text-~do~,-for-sequential-computation">
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mark Armstrong</p>
     <p class="author">Contact: <a href="mailto:markparmstrong@gmail.com">markparmstrong@gmail.com</a></p>
     <p class="date">Original date: </p>
     <p class="date">Last updated: 2020-11-06 Fri 13:32</p>
     <p class="creator">Created using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.91 (<a href="https://orgmode.org">Org</a> mode 9.4)</p>
     <p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
